# Brief Reference Cmd
Brief reference of the Cmd.

---

#### Show the help of a command
```
> help <command>
```

#### List the files of the current directory
```
> dir
```

#### Change directory
```
> cd <dir>
```

#### Change to the parent directory
```
> cd ..
```

#### Print the current date
```
> date
```
